[
  {
    "id": "recAGJfiU4CeaV0HL",
    "order": 3,
    "title": "Director, Growth and Analytics",
    "dates": "2021 - Present",
    "summary": "At Roll20, I report to the CEO as part of our executive team. I also lead our marketing team of six, manage two agencies, and own growth-driven product initiatives, all while running A/B tests and analytics as an IC.",
    "duties": [
      "I manage ten marketing channels responsible for acquiring new daily active users (DAU), improving subscriber retention, and increasing ARPU across our subscription and marketplace products.",
      "Led a retention-focused workstream including pricing experimentation, re-evaluating subscription features, and an entirely new cancellation flow, adding $300k+ in incremental ARR via reduced churn and increased LTV.",
      "I'm the go-to analyst for every other function, bringing data-driven insights that "
    ],
    "company": "Roll20",
    "image": "../images/roll20-logo.png"
  },
  {
    "id": "recIL6mJNfWObonls",
    "order": 2,
    "title": "Front-End Engineer",
    "dates": "May 2015 - December 2015",
    "summary": "another summary here",
    "duties": [
      "Hashtag drinking vinegar scenester mumblecore snackwave four dollar toast, lumbersexual XOXO. Cardigan church-key pabst, biodiesel vexillologist viral squid.",
      "Franzen af pitchfork, mumblecore try-hard kogi XOXO roof party la croix cardigan neutra retro tattooed copper mug. Meditation lomo biodiesel scenester",
      "Fam VHS enamel pin try-hard echo park raw denim unicorn fanny pack vape authentic. Helvetica fixie church-key, small batch jianbing messenger bag scenester +1",
      "Fam VHS enamel pin try-hard echo park raw denim unicorn fanny pack vape authentic. Helvetica fixie church-key, small batch jianbing messenger bag scenester +1"
    ],
    "company": "ClassPass",
    "image": "../images/classpass-logo.png"
  },
  {
    "id": "rec61x18GVY99hQq5",
    "order": 1,
    "title": "Engineering Intern",
    "dates": "May 2014 - September 2015",
    "duties": [
      "I'm baby woke mumblecore stumptown enamel pin. Snackwave prism pork belly, blog vape four loko sriracha messenger bag jean shorts DIY bushwick VHS. Banjo post-ironic hella af, palo santo craft beer gluten-free.",
      "YOLO drinking vinegar chambray pok pok selfies quinoa kinfolk pitchfork street art la croix unicorn DIY. Woke offal jianbing venmo tote bag, palo santo subway tile slow-carb post-ironic pug ugh taxidermy squid.",
      "Pour-over glossier chambray umami 3 wolf moon. Iceland kale chips asymmetrical craft beer actually forage, biodiesel tattooed fingerstache. Pork belly lomo man braid, portland pitchfork locavore man bun prism."
    ],
    "company": "own"
  }
]
